kidyur/stm32f101c8t6_drivers_sketches/lcd/lcd.h
/*
 * lcd.h
 *
 *  Created on: 17 июл. 2026 г.
 *      Author: kipin
 */

#ifndef INC_DEVICE_DRIVERS_LCD_H_
#define INC_DEVICE_DRIVERS_LCD_H_


#include "stm32f101xb.h"


enum lcd_pin_flag {
	lcd_pin_flag_0  = (0x0001ul << 0),
	lcd_pin_flag_1  = (0x0001ul << 1),
	lcd_pin_flag_2  = (0x0001ul << 2),
	lcd_pin_flag_3  = (0x0001ul << 3),
	lcd_pin_flag_4  = (0x0001ul << 4),
	lcd_pin_flag_5  = (0x0001ul << 5),
	lcd_pin_flag_6  = (0x0001ul << 6),
	lcd_pin_flag_7  = (0x0001ul << 7),
	lcd_pin_flag_8  = (0x0001ul << 8),
	lcd_pin_flag_9  = (0x0001ul << 9),
	lcd_pin_flag_10 = (0x0001ul << 10),
	lcd_pin_flag_11 = (0x0001ul << 11),
	lcd_pin_flag_12 = (0x0001ul << 12),
	lcd_pin_flag_13 = (0x0001ul << 13),
	lcd_pin_flag_14 = (0x0001ul << 14),
	lcd_pin_flag_15 = (0x0001ul << 15)
};


struct lcd_pin {
	GPIO_TypeDef * port;
	enum lcd_pin_flag pin_flag;
};



/**
 * Pass {0, 0} as V0 argument to agree with default layout
 *
 * [Default layout]
 * A0 - A7 -> D0 - D7
 * B15     -> V0
 * B14     -> RS
 * B13     -> RW
 * B12     -> E
 */
void lcd_init(
		struct lcd_pin * V0,
		struct lcd_pin * RS,
		struct lcd_pin * RW,
		struct lcd_pin * E,
		struct lcd_pin D[8]);



void lcd_switchDisplay(
		const uint8_t displayOn,
		const uint8_t cursorOn,
		const uint8_t blinkOn);


void lcd_clearScreen();


void lcd_inputSet(
		const uint8_t isIncrement,
		const uint8_t isShift);


void lcd_cursorReturn();


void lcd_shift(const uint8_t isRight, const uint8_t isDisplay);


void lcd_functionSet(
		const uint8_t dataLength,
		const uint8_t rows,
		const uint8_t format);


void lcd_read(const uint8_t flags);


void lcd_createChar(const uint8_t addr, const uint8_t * matrix);


void lcd_setCursorPosition(const uint8_t row, const uint8_t col);


void lcd_write(const uint8_t data);


void lcd_writeLine(const char * str);


#endif /* INC_DEVICE_DRIVERS_LCD_H_ */
